Revit 2026 API

# SpaceIsPointInSpace Method

---

Determines if a point lies within the volume of the Space.

**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsPointInSpace(
	XYZ point
)
```
```vb
Public Function IsPointInSpace (
	point As XYZ
) As Boolean
```
```cpp
public:
bool IsPointInSpace(
	XYZ^ point
)
```
```fsharp
member IsPointInSpace :
        point : XYZ -> bool
```

#### Parameters

point XYZ
    Point to be checked.

#### Return Value

Boolean

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when the point is . |
| ArgumentException | The coordinates of the point is not a number. |

#### Reference

Space Class

Autodesk.Revit.DB.Mechanical Namespace